Repository: caip0312-ui/MoodLock
Catalog: Shared/Localizable.xcstrings
Source language: zh_hans
Languages: en

source: 很难过
en: Very Unpleasant

source: 难过
en: Unpleasant

source: 一般
en: Neutral

source: 开心
en: Pleasant

source: 很开心
en: Very Pleasant

source: 心情档位
en: Mood Level

source: 设置
en: Settings

source: 历史
en: History

source: 图表
en: Charts

source: 语音录音
en: Voice Recording

source: 开启后，记录心情时可以立即补充一段语音。仅在 App 内可用，锁屏和桌面小组件不支持录音。
en: When enabled, you can add a voice note right after logging a mood. Only available in the app — Lock Screen and Home Screen widgets don't support recording.

source: 还没有记录
en: No entries yet

source: 历史记录
en: History

source: 检测到 %lld 条心情记录短时间内变化异常
en: Detected %lld mood entries changing rapidly

source: 点击查看
en: Tap to view

source: 没有异常记录
en: No flagged entries

source: 疑似异常记录
en: Flagged Entries

source: 完成
en: Done

source: 本月心情热力图
en: This Month's Heatmap

source: 本月心情趋势
en: This Month's Trend

source: 本月还没有记录
en: No entries yet this month

source: 本月心情分布
en: This Month's Distribution

source: 查看本月心情时刻分布（可选深度视图）
en: View this month's moment-by-moment scatter (optional deep view)

source: 这天没有记录
en: No entries this day

source: 心情时刻分布
en: Moment Distribution

source: 文字备注
en: Text Note

source: 写点什么…
en: Write something…

source: 语音备注
en: Voice Note

source: 记录详情
en: Entry Detail

source: 原始录音
en: Original Recording

source: 转文字归档
en: Transcribe & Archive

source: 没有麦克风权限，请到系统设置里开启。
en: No microphone permission — enable it in Settings.

source: 点右上角的按钮开始录音。
en: Tap the button in the top-right to start recording.

source: 转文字失败，请重试，或保留原始录音。
en: Transcription failed — try again, or keep the original recording.

source: 记录心情
en: Log Mood

source: 从 Widget 记录一次心情等级
en: Log a mood level from the widget

source: 心情等级
en: Mood Level

source: 来源
en: Source

source: 心情快速记录。
en: Quick mood logging.

source: 选择心情档位
en: Choose Mood Level

source: 选择这个小组件要记录的心情档位
en: Choose which mood level this widget logs

source: MoodLock 单档
en: MoodLock Single

source: 选择一个心情档位，固定放在锁屏上快速记录，长按可随时更换档位。
en: Pick one mood level to keep on your Lock Screen for quick logging — long-press anytime to change it.
